Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC4800_F100/RTE_Device.h
//   <o> I2S5_CLK OUTPUT Pin <0=>P3_6
#define RTE_I2S5_CLK_OUTPUT_ID                0
#if    (RTE_I2S5_CLK_OUTPUT_ID == 0)
#define RTE_I2S5_CLK_OUTPUT_PORT              P3_6
#define RTE_I2S5_CLK_AF                       P3_6_AF_U2C1_SCLKOUT
#else
#error "Invalid I2S5 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S5_CLK INPUT Pin <0=>P3_6
#define RTE_I2S5_CLK_INPUT_ID                0
#if    (RTE_I2S5_CLK_INPUT_ID == 0)
#define RTE_I2S5_CLK_INPUT_PORT              P3_6
#define RTE_I2S5_CLK_INPUT                   USIC2_C1_DX1_P3_6
#else
#error "Invalid I2S5 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S5_WS OUTPUT Pin <0=>P3_0 <1=>P4_1
#define RTE_I2S5_WS_OUTPUT_ID                0
#if     (RTE_I2S5_WS_OUTPUT_ID == 0)
#define RTE_I2S5_WS_OUTPUT_PORT              P3_0
#define RTE_I2S5_WS_AF                       P3_0_AF_U2C1_SELO0
#elif   (RTE_I2S5_WS_OUTPUT_ID == 1)
#define RTE_I2S5_WS_OUTPUT_PORT              P4_1
#define RTE_I2S5_WS_AF                       P4_1_AF_U2C1_SELO0
#else
#error "Invalid I2S5_WS Output Pin Configuration!"
#endif

//   <o> I2S5_WS INPUT Pin <0=>P4_1
#define RTE_I2S5_WS_INPUT_ID                 0
#if    (RTE_I2S5_WS_INPUT_ID == 0)
#define RTE_I2S5_WS_INPUT_PORT               P4_1
#define RTE_I2S5_WS_INPUT_ID_INPUT           USIC2_C1_DX2_P4_1
#else
#error "Invalid I2S5_WS Input Pin Configuration!"
#endif

// <e> Enable MCLK output
#define RTE_I2S5_MCLK_OUTPUT_ENABLE          0
//   <o> I2S5_MCLK OUTPUT Pin <0=>P3_4
#define RTE_I2S5_MCLK_OUTPUT_ID              0
#if    (RTE_I2S5_MCLK_OUTPUT_ID == 0)
#define RTE_I2S5_MCLK_OUTPUT_PORT            P3_4
#define RTE_I2S5_MCLK_AF                     P3_4_AF_U2C1_MCLKOUT
#else
#error "Invalid I2S5_MCLK Output Pin Configuration!"
#endif
// </e>

//   <o> I2S5_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S5_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S5_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S5_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S5_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S5_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S5_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S5_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S5_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S5_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S5_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S5_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S5_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S5_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S5_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S5_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S5_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S5_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S5_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S5_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S5_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S5_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S5_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S5_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S5_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S5_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S5_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S5_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S5_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S5_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S5_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S5_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S5_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S5_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S5_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S5_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S5_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S5_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S5_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S5_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S5_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S5_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 63
#define RTE_I2S5_IRQ_PRIORITY  63

//</e>

// <e> ENET (Ethernet Interface) [Driver_ETH_MAC0]
// <i> Configuration settings for Driver_ETH_MAC0 in component ::Drivers:Ethernet MAC
#define   RTE_ENET                      0

#define   RTE_ENET_MII                  0
#define   RTE_ENET_RMII                 1

//     <o> TXD0 (Transmit data bit 0) pin 
//       <0=>P0_5
//       <1=>P1_13
//       <2=>P2_8
#define   RTE_ENET_RMII_TXD0_PIN_ID     0

#if (RTE_ENET_RMII_TXD0_PIN_ID == 0)
 #define RTE_ENET_RMII_TXD0_PIN  P0_5
 #define RTE_ENET_RMII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXD0_PIN_ID == 1)
 #define RTE_ENET_RMII_TXD0_PIN  P1_13
 #define RTE_ENET_RMII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXD0_PIN_ID == 2)
 #define RTE_ENET_RMII_TXD0_PIN  P2_8
 #define RTE_ENET_RMII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXD0 pin!"
#endif

//     <o> TXD1 (Transmit data bit 1) pin 
//       <0=>P0_6
//       <1=>P1_14
//       <2=>P2_9
#define   RTE_ENET_RMII_TXD1_PIN_ID     0

#if (RTE_ENET_RMII_TXD1_PIN_ID == 0)
 #define RTE_ENET_RMII_TXD1_PIN  P0_6
 #define RTE_ENET_RMII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXD1_PIN_ID == 1)
 #define RTE_ENET_RMII_TXD1_PIN  P1_14
 #define RTE_ENET_RMII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXD1_PIN_ID == 2)
 #define RTE_ENET_RMII_TXD1_PIN  P2_9
 #define RTE_ENET_RMII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXD1 pin!"
#endif

//     <o> TXEN (Transmit Enable) pin 
//       <0=>P0_4
//       <1=>P1_12
//       <2=>P2_5
#define   RTE_ENET_RMII_TXEN_PIN_ID     0

#if (RTE_ENET_RMII_TXEN_PIN_ID == 0)
 #define RTE_ENET_RMII_TXEN_PIN  P0_4
 #define RTE_ENET_RMII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXEN_PIN_ID == 1)
 #define RTE_ENET_RMII_TXEN_PIN  P1_12
 #define RTE_ENET_RMII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_RMII_TXEN_PIN_ID == 2)
 #define RTE_ENET_RMII_TXEN_PIN  P2_5
 #define RTE_ENET_RMII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXEN pin!"
#endif

//     <o> RXD0 (Receive data bit 0) pin 
//       <0=>P2_2
//       <1=>P0_2
//       <2=>P14_8
//       <3=>P5_0
#define   RTE_ENET_RMII_RXD0_PIN_ID     0

#if (RTE_ENET_RMII_RXD0_PIN_ID == 0)
 #define RTE_ENET_RMII_RXD0_PIN  P2_2
#elif (RTE_ENET_RMII_RXD0_PIN_ID == 1)
 #define RTE_ENET_RMII_RXD0_PIN  P0_2
#elif (RTE_ENET_RMII_RXD0_PIN_ID == 2)
 #define RTE_ENET_RMII_RXD0_PIN  P14_8
#elif (RTE_ENET_RMII_RXD0_PIN_ID == 3)
 #define RTE_ENET_RMII_RXD0_PIN  P5_0
#else
 #error "Invalid RXD0 pin!"
#endif

//     <o> RXD1 (Receive data bit 1) pin 
//       <0=>P2_3
//       <1=>P0_3
//       <2=>P14_9
//       <3=>P5_1
#define   RTE_ENET_RMII_RXD1_PIN_ID     0

#if (RTE_ENET_RMII_RXD1_PIN_ID == 0)
 #define RTE_ENET_RMII_RXD1_PIN  P2_3
#elif (RTE_ENET_RMII_RXD1_PIN_ID == 1)
 #define RTE_ENET_RMII_RXD1_PIN  P0_3
#elif (RTE_ENET_RMII_RXD1_PIN_ID == 2)
 #define RTE_ENET_RMII_RXD1_PIN  P14_9
#elif (RTE_ENET_RMII_RXD1_PIN_ID == 3)
 #define RTE_ENET_RMII_RXD1_PIN  P5_1
#else
 #error "Invalid RXD1 pin!"
#endif

