Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC4800_F100/RTE_Device.h
//     <o> CRS_DV (Carrier Sense Data Valid) pin 
//       <0=>P2_5
//       <1=>P0_1
//       <2=>P15_9
//       <3=>P5_2
#define   RTE_ENET_RMII_CRS_DV_PIN_ID     0

#if (RTE_ENET_RMII_CRS_DV_PIN_ID == 0)
 #define RTE_ENET_RMII_CRS_DV_PIN  P2_5
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 1)
 #define RTE_ENET_RMII_CRS_DV_PIN  P0_1
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 2)
 #define RTE_ENET_RMII_CRS_DV_PIN  P15_9
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 3)
 #define RTE_ENET_RMII_CRS_DV_PIN  P5_2
#else
 #error "Invalid CRS_DV pin!"
#endif

//     <o> RXER (Receive Error) pin 
//       <0=>P2_4
//       <2=>P0_11
#define   RTE_ENET_RMII_RXER_PIN_ID     0

#if (RTE_ENET_RMII_RXER_PIN_ID == 0)
 #define RTE_ENET_RMII_RXER_PIN  P2_4
#elif (RTE_ENET_RMII_RXER_PIN_ID == 2)
 #define RTE_ENET_RMII_RXER_PIN  P0_11
#else
 #error "Invalid RXER pin!"
#endif

//     <o> REFCLK (Reference clock) pin 
//       <0=>P2_1
//       <1=>P0_0
//       <2=>P15_8
#define   RTE_ENET_RMII_REFCLK_PIN_ID     0

#if (RTE_ENET_RMII_REFCLK_PIN_ID == 0)
 #define RTE_ENET_RMII_REFCLK_PIN  P2_1
#elif (RTE_ENET_RMII_REFCLK_PIN_ID == 1)
 #define RTE_ENET_RMII_REFCLK_PIN  P0_0
#elif (RTE_ENET_RMII_REFCLK_PIN_ID == 2)
 #define RTE_ENET_RMII_REFCLK_PIN  P15_8
#else
 #error "Invalid REFCLK pin!"
#endif

//   <h> MIIM (Management Data Interface)
//     <o> MDIO (Management data I/O line) pin 
//       <0=>P0_9
//       <1=>P2_0
//       <2=>P1_11
#define   RTE_ENET_MIIM_MDIO_PIN_ID     0

#if (RTE_ENET_MIIM_MDIO_PIN_ID == 0)
 #define RTE_ENET_MIIM_MDIO_PIN   P0_9
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#elif (RTE_ENET_MIIM_MDIO_PIN_ID == 1)
 #define RTE_ENET_MIIM_MDIO_PIN   P2_0
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#elif (RTE_ENET_MIIM_MDIO_PIN_ID == 2)
 #define RTE_ENET_MIIM_MDIO_PIN   P1_11
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#else
 #error "Invalid MDIO pin!"
#endif

//     <o> MDC (Management data clock line) pin 
//       <0=>P0_10
//       <1=>P1_10
//       <2=>P2_7
#define   RTE_ENET_MIIM_MDC_PIN_ID     0

#if (RTE_ENET_MIIM_MDC_PIN_ID == 0)
 #define RTE_ENET_MIIM_MDC_PIN  P0_10
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MIIM_MDC_PIN_ID == 1)
 #define RTE_ENET_MIIM_MDC_PIN  P1_10
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MIIM_MDC_PIN_ID == 2)
 #define RTE_ENET_MIIM_MDC_PIN  P2_7
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid MDC pin!"
#endif

//   </h> MIIM (Management Data Interface)

// <o>IRQ Priority <0-63>
// <i> Defines priority of ENET events IRQ handling
// <i> Default: 63
#define RTE_ENET_IRQ_PRIORITY  63

// </e> ENET (Ethernet Interface) [Driver_ETH_MAC0]

// <e> USB (Universal Serial Bus) [Driver_USBH]
// <i> Configuration settings for Driver_USBH0 in component ::Drivers:USB Host
#define RTE_USB_HOST         0

// <o>IRQ Priority <0-63>
// <i> Defines priority of USBH events IRQ handling
// <i> Default: 63
#define RTE_USB_HOST_IRQ_PRIORITY  63

//     <o> VBUS drive pin setting <0=>P0_1 <1=>P3_2

#define   RTE_USB_HOST_ID         0
#if (RTE_USB_HOST_ID == 0)
 #define XMC_USB_DRIVE_PORT    P0_1
#elif  (RTE_USB_HOST_ID == 1)
 #define XMC_USB_DRIVE_PORT    P3_2
#else
 #error "Invalid USB Host pin!"
#endif

// </e> USB (Universal Serial Bus) [Driver_USBH]

// <e> USB (Universal Serial Bus) [Driver_USBD]
// <i> Configuration settings for Driver_USBD0 in component ::Drivers:USB Device
#define RTE_USB_DEVICE         0

// <o>IRQ Priority <0-63>
// <i> Defines priority of USBD events IRQ handling
// <i> Default: 63
#define RTE_USB_DEVICE_IRQ_PRIORITY  63

// </e> USB (Universal Serial Bus) [Driver_USBD]

// <e> SD/MMC Interface [Driver_MCI0]
// <i> Configuration settings for Driver_MCI0 in component ::Drivers:MCI
#define RTE_SDMMC0                      0

// <e> MCI Card detection pin enable
#define RTE_SDMMC_CD_PIN_EN 0
//   <q> MCI Card detection event enable
#define RTE_SDMMC_CD_EVENT_EN           0
//   <o> MCI Card Detection Pin <0=>P1_10
#define RTE_SDMMC0_CD_PIN_ID            0
#if (RTE_SDMMC0_CD_PIN_ID == 0)
#define RTE_SDMMC_CARD_DETECT_PORT      PORT1_BASE
#define RTE_SDMMC_CARD_DETECT_PIN       10
#else
#error "Invalid SDMMC0_CD Pin Configuration!"
#endif
//</e>

// <e> MCI Write protection pin enable
#define RTE_SDMMC_WP_PIN_EN             0
//   <o> MCI Write Protection Pin <0=>P1_1
#define RTE_SDMMC0_WP_PIN_ID            0
#if (RTE_SDMMC0_WP_PIN_ID == 0)
#define RTE_SDMMC_WRITE_PROTECT_PORT    PORT1_BASE
#define RTE_SDMMC_WRITE_PROTECT_PIN     1
#else
#error "Invalid SDMMC0_WP Pin Configuration!"
#endif
// </e>

// <e> MCI Power pin enable
#define RTE_SDMMC_PWR_PIN_EN            0
//   <o> MCI Bus Power Pin <0=>P3_4
#define RTE_SDMMC0_BUS_POWER_PIN_ID     0
#if (RTE_SDMMC0_BUS_POWER_PIN_ID == 0)
#define RTE_SDMMC_BUS_POWER_PORT        PORT3_BASE
#define RTE_SDMMC_BUS_POWER_PIN         4
#else
#error "Invalid SDMMC0_BUS_POWER Pin Configuration!"
#endif
// </e>

// <e> MCI Reset pin enable
#define RTE_SDMMC_RESET_PIN_EN          0
//   <o> MCI Reset Pin <0=>P0_11
#define RTE_SDMMC0_RESET_PIN_ID         0
#if (RTE_SDMMC0_RESET_PIN_ID == 0)
#define RTE_SDMMC_RESET_PORT            PORT0_BASE
#define RTE_SDMMC_RESET_PIN             11
#else
#error "Invalid SDMMC0_RESET Pin Configuration!"
#endif
// </e>

// <o> MCI DATA0 Pin <0=>P4_0
#define RTE_SDMMC0_DATA0_PIN_ID         0
#if (RTE_SDMMC0_DATA0_PIN_ID == 0)
#define RTE_SDMMC_DATA_0_PORT           PORT4_BASE
#define RTE_SDMMC_DATA_0_PIN            0
#else
#error "Invalid SDMMC0_DATA0 Pin Configuration!"
#endif

// <e> MCI 4 bit bus width enable
#define RTE_SDMMC_BUS_WIDTH_4           1

//   <o> MCI DATA1 Pin <0=>P1_6
#define RTE_SDMMC0_DATA1_PIN_ID         0
#if (RTE_SDMMC0_DATA1_PIN_ID == 0)
#define RTE_SDMMC_DATA_1_PORT           PORT1_BASE
#define RTE_SDMMC_DATA_1_PIN            6
#else
#error "Invalid SDMMC0_DATA1 Pin Configuration!"
#endif

//   <o> MCI DATA2 Pin <0=>P1_7
#define RTE_SDMMC0_DATA2_PIN_ID         0
#if (RTE_SDMMC0_DATA2_PIN_ID == 0)
#define RTE_SDMMC_DATA_2_PORT           PORT1_BASE
#define RTE_SDMMC_DATA_2_PIN            7
#else
#error "Invalid SDMMC0_DATA2 Pin Configuration!"
#endif

//   <o> MCI DATA3 Pin <0=>P4_1
#define RTE_SDMMC0_DATA3_PIN_ID         0
#if (RTE_SDMMC0_DATA3_PIN_ID == 0)
#define RTE_SDMMC_DATA_3_PORT           PORT4_BASE
#define RTE_SDMMC_DATA_3_PIN            1
#else
#error "Invalid SDMMC0_DATA3 Pin Configuration!"
#endif
// </e>

// <o> MCI CMD Pin <0=>P3_5
#define RTE_SDMMC0_CMD_PIN_ID           0
#if (RTE_SDMMC0_CMD_PIN_ID == 0)
#define RTE_SDMMC_COMMAND_PORT          PORT3_BASE
#define RTE_SDMMC_COMMAND_PIN           5
#else
#error "Invalid SDMMC0_CMD Pin Configuration!"
#endif

// <o> MCI CLK Pin <0=>P3_6
#define RTE_SDMMC0_CLK_PIN_ID           0
#if (RTE_SDMMC0_CLK_PIN_ID == 0)
#define RTE_SDMMC_CLK_PORT              PORT3_BASE
#define RTE_SDMMC_CLK_PIN               6
#else
#error "Invalid SDMMC0_CLK Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of SDMMC events IRQ handling
// <i> Default: 63
#define RTE_SDMMC_IRQ_PRIORITY  63

// </e> SD/MMC Interface [Driver_MCI0]

#if ((RTE_UART0+RTE_I2C0+RTE_SPI0+RTE_I2S0)>1)
#error "Choose just one Driver_I2C0/SPI0/UART0/SAI0 driver !"
#elif ((RTE_UART1+RTE_I2C1+RTE_SPI1+RTE_I2S1)>1)
#error "Choose just one Driver_I2C1/SPI1/UART1/SAI1 driver !"
#elif ((RTE_UART2+RTE_I2C2+RTE_SPI2+RTE_I2S2)>1)
#error "Choose just one Driver_I2C2/SPI2/UART2/SAI2 driver !"
#elif ((RTE_UART3+RTE_I2C3+RTE_SPI3+RTE_I2S3)>1)
#error "Choose just one Driver_I2C3/SPI3/UART3/SAI3 driver !"
#elif ((RTE_UART4+RTE_I2C4+RTE_SPI4+RTE_I2S4)>1)
#error "Choose just one Driver_I2C4/SPI4/UART4/SAI4 driver !"
#elif ((RTE_UART5+RTE_I2C5+RTE_SPI5+RTE_I2S5)>1)
#error "Choose just one Driver_I2C5/SPI5/UART5/SAI5 driver !"
#endif

#if (((RTE_UART0_RX_FIFO_SIZE_NUM*RTE_UART0)+\
      (RTE_I2C0_RX_FIFO_SIZE_NUM*RTE_I2C0)+\
      (RTE_SPI0_RX_FIFO_SIZE_NUM*RTE_SPI0)+\
      (RTE_I2S0_RX_FIFO_SIZE_NUM*RTE_I2S0)+\
      (RTE_UART1_RX_FIFO_SIZE_NUM*RTE_UART1)+\
      (RTE_I2C1_RX_FIFO_SIZE_NUM*RTE_I2C1)+\
      (RTE_SPI1_RX_FIFO_SIZE_NUM*RTE_SPI1)+\
      (RTE_I2S1_RX_FIFO_SIZE_NUM*RTE_I2S1)+\
      (RTE_UART0_TX_FIFO_SIZE_NUM*RTE_UART0)+\
      (RTE_I2C0_TX_FIFO_SIZE_NUM*RTE_I2C0)+\
      (RTE_SPI0_TX_FIFO_SIZE_NUM*RTE_SPI0)+\
      (RTE_I2S0_TX_FIFO_SIZE_NUM*RTE_I2S0)+\
      (RTE_UART1_TX_FIFO_SIZE_NUM*RTE_UART1)+\
      (RTE_I2C1_TX_FIFO_SIZE_NUM*RTE_I2C1)+\
      (RTE_SPI1_TX_FIFO_SIZE_NUM*RTE_SPI1)+\
      (RTE_I2S1_TX_FIFO_SIZE_NUM*RTE_I2S1))>64)
#error "Just 64 positions in a FIFO shared by RTE_x0 and RTE_x1 !"
#elif (((RTE_UART2_RX_FIFO_SIZE_NUM*RTE_UART2)+\
        (RTE_I2C2_RX_FIFO_SIZE_NUM*RTE_I2C2)+\
        (RTE_SPI2_RX_FIFO_SIZE_NUM*RTE_SPI2)+\
        (RTE_I2S2_RX_FIFO_SIZE_NUM*RTE_I2S2)+\
        (RTE_UART3_RX_FIFO_SIZE_NUM*RTE_UART3)+\
        (RTE_I2C3_RX_FIFO_SIZE_NUM*RTE_I2C3)+\
        (RTE_SPI3_RX_FIFO_SIZE_NUM*RTE_SPI3)+\
        (RTE_I2S3_RX_FIFO_SIZE_NUM*RTE_I2S3)+\
        (RTE_UART2_TX_FIFO_SIZE_NUM*RTE_UART2)+\
        (RTE_I2C2_TX_FIFO_SIZE_NUM*RTE_I2C2)+\
        (RTE_SPI2_TX_FIFO_SIZE_NUM*RTE_SPI2)+\
        (RTE_I2S2_TX_FIFO_SIZE_NUM*RTE_I2S2)+\
        (RTE_UART3_TX_FIFO_SIZE_NUM*RTE_UART3)+\
        (RTE_I2C3_TX_FIFO_SIZE_NUM*RTE_I2C3)+\
        (RTE_SPI3_TX_FIFO_SIZE_NUM*RTE_SPI3)+\
        (RTE_I2S3_TX_FIFO_SIZE_NUM*RTE_I2S3))>64)
#error "Just 64 positions in a FIFO shared by RTE_x2 and RTE_x3 !"
#elif (((RTE_UART4_RX_FIFO_SIZE_NUM*RTE_UART4)+\
        (RTE_I2C4_RX_FIFO_SIZE_NUM*RTE_I2C4)+\
        (RTE_SPI4_RX_FIFO_SIZE_NUM*RTE_SPI4)+\
        (RTE_I2S4_RX_FIFO_SIZE_NUM*RTE_I2S4)+\
        (RTE_UART5_RX_FIFO_SIZE_NUM*RTE_UART5)+\
        (RTE_I2C5_RX_FIFO_SIZE_NUM*RTE_I2C5)+\
        (RTE_SPI5_RX_FIFO_SIZE_NUM*RTE_SPI5)+\
        (RTE_I2S5_RX_FIFO_SIZE_NUM*RTE_I2S5)+\
        (RTE_UART4_TX_FIFO_SIZE_NUM*RTE_UART4)+\
        (RTE_I2C4_TX_FIFO_SIZE_NUM*RTE_I2C4)+\
        (RTE_SPI4_TX_FIFO_SIZE_NUM*RTE_SPI4)+\
        (RTE_I2S4_TX_FIFO_SIZE_NUM*RTE_I2S4)+\
        (RTE_UART5_TX_FIFO_SIZE_NUM*RTE_UART5)+\
        (RTE_I2C5_TX_FIFO_SIZE_NUM*RTE_I2C5)+\
        (RTE_SPI5_TX_FIFO_SIZE_NUM*RTE_SPI5)+\
        (RTE_I2S5_TX_FIFO_SIZE_NUM*RTE_I2S5))>64)
#error "Just 64 positions in a FIFO shared by RTE_x4 and RTE_x5 !"
#endif

#endif  /* __RTE_DEVICE_H */
